Tekla Open API Reference for Tekla Structures 2025
Matrix.Item Property
 Sets or gets the matrix element values.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double this[
	int row,
	int column
] { get; set; }
Public Default Property Item (
	row As Integer,
	column As Integer
) As Double
	Get
	Set
Parameters
row
Type: System.Int32
The matrix row index (0-3).
column
Type: System.Int32
The matrix column index (0-2).
Return Value
Type: Double
The value at the specified index.
See Also
Reference
Matrix Class
Tekla.Structures.Geometry3d Namespace